# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsArray..::..Insert Method
CurveByPointsArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	CurveByPoints item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As CurveByPoints, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	CurveByPoints^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CurveByPoints
index
    Type: System..::..Int32
# See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace